app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @booknew = Book.new
  	@book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "uuuuuuu"], ["body", "uuuuuuuuuu"], ["user_id", 2], ["created_at", "2020-02-22 10:11:20.985328"], ["updated_at", "2020-02-22 10:11:20.985328"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
  	@book.user_id = current_user.id
    if @book.save #入力されたデータをdbに保存する。
  		redirect_to @book, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
  def edit
  	@book = Book.find(params[:id])
    if @book.user == current_user
    else
      @book = Book.new
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
---
  def destroy
  	@book = Book.find(params[:id])
  	@book.delete