app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def edit
  	@user = User.find(params[:id])
    if @user == current_user
    else
      @book = Book.new
      @users = User.all